Задача 1
--------
Дана порождающая матрица

$$
G = \left[\begin{array}{}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
1 & 0 & 1 & 1 & 0 \\
\end{array}
\right]
$$

- Построить проверочную матрицу
- Определить все характеристики кода
- Построить таблицу для синдромного декодирования

Элементарными преобразованиями приведем порождающую матрицу к систематическому виду:

$$
G = \begin{bmatrix}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
1 & 0 & 1 & 1 & 0
\end{bmatrix} \rightarrow
\begin{bmatrix}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
1 & 0 & 0 & 1 & 1
\end{bmatrix} \rightarrow
\begin{bmatrix}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
0 & 1 & 0 & 0 & 1
\end{bmatrix} \rightarrow
\begin{bmatrix}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
0 & 0 & 1 & 0 & 0
\end{bmatrix} \rightarrow
\begin{bmatrix}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 0 & 0 & 1 \\
0 & 0 & 1 & 0 & 0
\end{bmatrix}
$$

Получим 

$$
G_{sys} = \begin{bmatrix}
1 & 0 & 0 & 1 & 1 \\
0 & 1 & 0 & 0 & 1 \\
0 & 0 & 1 & 0 & 0
\end{bmatrix}
$$

Тогда

$$
H_{sys} = \begin{bmatrix}
1 & 0 & 0 & 1 & 0 \\
1 & 1 & 0 & 0 & 1 \\
\end{bmatrix}
$$

Обращая применённые преобразования, получим:

$$
H = \begin{bmatrix}
1 & 1 & 1 & 0 & 0 \\
1 & 0 & 0 & 1 & 0 \\
\end{bmatrix}
$$

Характеристики кода:
- Длина кода n = 5
- Размерность кода k = 3
- Количество проверочных символов r = n − k = 2
- Количество кодовых слов $2^k = 8$
- Скорость кода R = k/n = 3/5
- Минимальное расстояние $d_min = 1$. (Т.к. сумма трех строк порождающей матрицы тоже является кодовым словом, и эта сумма равна 00001, вес равен 1, значит любое другое ненулевое кодовое слово будет иметь больший вес.)
Значит такой код не исправляет ни одной ошибки. 

Поскольку **m = 2**, возможные синдромы: **00, 01, 10, 11**  
Переберём все возможные вектора ошибки и их синдромы:

| Ошибка e | Синдром s(e) |
|----------|--------------|
| 00000    | 00           |
| 00001    | 00           |
| 00010    | 01           |
| 00011    | 01           |
| 00100    | 10           |
| 00101    | 10           |
| 00110    | 11           |
| 00111    | 11           |
| 01000    | 10           |
| 01001    | 10           |
| 01010    | 11           |
| 01011    | 11           |
| 01100    | 00           |
| 01101    | 00           |
| 01110    | 01           |
| 01111    | 01           |
| 10000    | 11           |
| 10001    | 11           |
| 10010    | 10           |
| 10011    | 10           |
| 10100    | 01           |
| 10101    | 01           |
| 10110    | 00           |
| 10111    | 00           |
| 11000    | 01           |
| 11001    | 01           |
| 11010    | 00           |
| 11011    | 00           |
| 11100    | 11           |
| 11101    | 11           |
| 11110    | 10           |
| 11111    | 10           |

Получили 4 уникальные группы синдромов, тогда в каждой из них выберем слово с минимальным весом и составим таблицу:

| s   | e     |
| --- | ----- |
| 00  | 00000 |
| 01  | 00010 |
| 10  | 01000 |
| 11  | 10000 |


Задача 2
--------
Для двоичного кода Голея (23,12) определите минимальное расстояние и докажите, что код достигает границы Хэмминга.

С помощью следующего кода:
```python
import numpy as np

def binary_golay_generator_matrix():
    I = np.eye(12, dtype=int)

    B = np.array([
        [1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0],
        [1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1],
        [0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1],
        [1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0],
        [1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1],
        [1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1],
        [0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1],
        [0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0],
        [0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0],
        [1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0],
        [0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
    ], dtype=int)
    
    G = np.hstack((I, B))  # 12 × 23
    return G

def weight(v):
    return np.sum(v)

def minimum_distance():
    G = binary_golay_generator_matrix()
    min_d = 23
    
    for i in range(1, 1 << 12):
        coeffs = np.array([(i >> j) & 1 for j in range(12)], dtype=int)
        codeword = np.dot(coeffs, G) % 2
        w = weight(codeword)
        if 0 < w < min_d:
            min_d = w
    
    return min_d

if __name__ == "__main__":
    d = minimum_distance()
    print(f"d_min = {d}")
```
Вывод программы: d_min = 7

По формуле
$t \le \lfloor{\frac{d_{min} - 1}{2}}\rfloor = 3$

Пусть t = 3:
$M = 2^{12} =4096$

Граница Хэмминга для двоичного кода:  

$$
\sum_{i=0}^{t}C_n^i(2-1)^i=\sum_{i=0}^{t}C_n^i=C_n^0+C_n^1+C_n^2+C_n^3=2048=2^{11}
$$

$$
\frac{2^{23}}{2^{11}}=2^{12}=M
$$

$t \le 3 \Rightarrow \frac{2^{23}}{\sum_{i=0}^{t}C_n^i(2-1)^i} \ge 2^{12}=M$

То есть граница Хэмминга достигается.
